In [1]:
import numpy as np
import pandas as pd

# NumPy example
array = np.array([1, 2, 3, 4, 5])
print("NumPy Array:", array)

# Pandas example
data = {'Name': ['John', 'Anna', 'Peter', 'Linda', 'Alice', 'Jane', 'Robert', 'Tom', 'Megan', 'Joe', 'Mike'],
        'Age': [28, 24, 35, 32, 27, 30, 29, 33, 31, 34, 30]}
df = pd.DataFrame(data)
print("Pandas DataFrame:\n", df)

NumPy Array: [1 2 3 4 5]
Pandas DataFrame:
       Name  Age
0     John   28
1     Anna   24
2    Peter   35
3    Linda   32
4    Alice   27
5     Jane   30
6   Robert   29
7      Tom   33
8    Megan   31
9      Joe   34
10    Mike   30

In [2]:
df.head()

    Name  Age
0   John   28
1   Anna   24
2  Peter   35
3  Linda   32
4  Alice   27

In [3]:
df.tail()

      Name  Age
6   Robert   29
7      Tom   33
8    Megan   31
9      Joe   34
10    Mike   30